Revit 2027 API
FamilyStructuralMaterialTypeFilter(StructuralMaterialType, Boolean) Constructor
 Constructs a new instance of a filter to match families by structural material type, with the option to match all families which are not of the given structural material type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyStructuralMaterialTypeFilter(
	StructuralMaterialType structuralMaterialType,
	bool inverted
)
Public Sub New (
	structuralMaterialType As StructuralMaterialType,
	inverted As Boolean
)
public:
FamilyStructuralMaterialTypeFilter(
	StructuralMaterialType structuralMaterialType,
	bool inverted
)
new :
        structuralMaterialType : StructuralMaterialType *
        inverted : bool -> FamilyStructuralMaterialTypeFilter
Parameters
structuralMaterialType StructuralMaterialType
 The structural material type to match.
inverted Boolean
 True if the filter should match all families which are not of the given structural material type.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FamilyStructuralMaterialTypeFilter Class
FamilyStructuralMaterialTypeFilter Overload
Autodesk.Revit.DB.Structure Namespace